# 문제 : 정수 하나를 입력받아 출력한 후, 10 만큼 증가시켜 출력하는 프로그램을 작성하시오.

# 입력 : 첫 줄에 100 이하의 양의 정수가 주어진다.

# 출력 : 첫 줄에 입력받은 정수를 출력한다. 두 번째 줄에 입력받은 정수에 10을 더한 값을 출력한다.

#############################################

n = int(input())
# print(n)
print(f"{n}\n{n + 10}")

#############################################(방법01)

# inp = input()
# print(inp)
# print(int(inp) + 10)

#############################################(방법02)

# a = int(input())
# print(a)
# print(a + 10)

#############################################(방법03)
