def line():
    print("=" * 25)

line()
print("line 함수를 호출하였습니다.")
print("line 함수를 다시 호출합니다.")
line()

##########################################################(방법01)

def line(n=25):
    if n == 0:        
        print()       
        return
    print('=', end='')
    line(n - 1)

line()
print("line 함수를 호출하였습니다.")
print("line 함수를 다시 호출합니다.")
line()

##########################################################(방법02)

def draw_line():
    print("=" * 25)

draw_line()
print("line 함수를 호출하였습니다.")
print("line 함수를 다시 호출합니다.")
draw_line()

##########################################################(방법03)

def line():
    print('='*25)
    print('line 함수를 호출하였습니다.')
    print('line 함수를 다시 호출합니다.')
    print('='*25)
line()

##########################################################(방법04)


