A = input()
for char in A:
    print(char, end=" ")

#####################################(방법01)

A = input()
print(*A)

#####################################(방법02)

A = input()
result = " ".join(A)
print(result)

#####################################(방법03)

inp = input()
for inp in A:
    print(inp, end = ' ')

#####################################(방법04)

a = list(input())
print(*a)

#####################################(방법05)

a = input()
print(f"{a}")

#####################################(방법06)
