A = ['a', 'b', 'c', 'd', 'e']
print(A)

for i in range(len(A) - 1, -1, -1):
    print(A[i], end=' ')

################################################################(for 반복문 - 방법01)

A = ['a', 'b', 'c', 'd', 'e']
print(A)

i = len(A) - 1 
while i >= 0:
    print(A[i], end=' ')
    i -= 1

################################################################(while 반복문 - 방법02)

A = ['a', 'b', 'c', 'd', 'e']
print(A)

for char in A[::-1]:
    print(char, end=' ')

################################################################(for 반복문 - 방법03)

A = ['a', 'b', 'c', 'd', 'e']
print(A)

i = -1
while i >= -len(A):
    print(A[i], end=' ')
    i -= 1

################################################################(while 반복문 - 방법04)

A = ['a', 'b', 'c', 'd', 'e']
print(A)

# for x in A:
#     print(x, end=' ')
# print()

# for x in range(4, -1, -1):
for x in range(len(A) - 1, -1, -1):
    print(A[x], end=' ')
print()

################################################################(방법05)

A = ['a', 'b', 'c', 'd', 'e']
print(A)

length = len(A)
# print(Length)

i = 1
while i <= length:
    print(A[length-i], end= ' ')
    i += 1

################################################################(방법06)

