# 문제

# 첫째 줄에는 별 1개, 둘째 줄에는 별 2개, N번째 줄에는 별 N개를 찍는 문제

# 하지만, 오른쪽을 기준으로 정렬한 별(예제 참고)을 출력하시오.

# 입력
# 첫째 줄에 N(1 ≤ N ≤ 100)이 주어진다.

# 출력
# 첫째 줄부터 N번째 줄까지 차례대로 별을 출력한다.

# 예제 입력 1 
# 5
# 예제 출력 1 
#     *
#    **
#   ***
#  ****
# *****

################################################(방법01)

n = int(input())
# print(n)
for i in range(1, n + 1):
    print(' ' * (n - i) + '*' * i)

################################################(방법01)

n = int(input())
# print(n)
for i in range(1, n + 1):
    for j in range(n - i):
        print(" ", end="")
        
    for j in range(i):
        print("*", end="")
        
    print()

################################################(방법02)

N = int(input())
# print(N)

for row in range(N):
    for col in range(N-row-1):
        print("?", end='')

    for col2 in range(row+1):
        print("*", end='')
    print()

################################################(방법03)

a=int(input())
for i in range(1,a+1):
    print((i*"*").rjust(a))     # 우측 정렬

################################################(방법04)







